{
    "_version": 1,
    "id": "tracker-capture",
    "disabled": false,
    "dhisAppKey": "tracker-capture",
    "name": { "key": "module-name", "referenceValue": "Tracker Capture", "translations": {} },
    "icon": "https://user-images.githubusercontent.com/2181866/109413195-7c333a80-79ac-11eb-811a-e1c75268df83.png",
    "type": "core",
    "revision": 4,
    "dhisVersionRange": "",
    "dhisLaunchUrl": "/dhis-web-tracker-capture/index.html",
    "dhisAuthorities": ["M_dhis-web-tracker-capture"],
    "translation": { "provider": "poeditor", "project": "399449" },
    "contents": {
        "welcome": {
            "key": "module-welcome",
            "referenceValue": "# Welcome to the tutorial on Tracker Capture\n\n![Welcome Illustration](https://user-images.githubusercontent.com/2181866/102778068-26318d80-4392-11eb-8858-88ee59c03935.png)\n\nTracker capture allows you to track individuals that are moving through different phases of a program (e.g tracking a women through her medical checks during a pregnancy).",
            "translations": {}
        },
        "steps": [
            {
                "title": {
                    "key": "step-1-title",
                    "referenceValue": "Select your location",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-1-1",
                        "translations": {},
                        "referenceValue": "![Select your location](https://user-images.githubusercontent.com/2181866/102776377-ed43e980-438e-11eb-8fa6-51035e3ba183.gif)\n\nFind the name of the location that you want to enter data for on the drop-down tree menu. You can click down to lower geographic levels on the menu by clicking on the plus icons next to the location names. Click on your location name to select it."
                    },
                    {
                        "key": "step-1-2",
                        "translations": {},
                        "referenceValue": "![Select your location](https://user-images.githubusercontent.com/2181866/102776378-eddc8000-438e-11eb-9522-7d07ba2bf04c.gif)\n\nAnother quick way to find a location is to use the search box above the drop-down tree menu. Click on the green lens icon and start typing the location name in the search bar. A list of locations will appear in a drop-down menu. Click on your location name to select it."
                    }
                ]
            },
            {
                "title": {
                    "key": "step-2-title",
                    "referenceValue": "Select your program",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-2-1",
                        "translations": {},
                        "referenceValue": "![Select your program](https://user-images.githubusercontent.com/2181866/102776379-eddc8000-438e-11eb-8962-4d31594f13e7.gif)\n\nClick on the bar with text 'Search or select from the list' to access the drop-down menu of program names. You can also search for a program by typing its name in the search bar.\n\nFind the program that you would like to enter data for and click on it to select it.\n\n<i>Note: You will only see programs that are associated with the location that you selected in Step 1 and the programs that you have been given access to by your administrator.</i>"
                    }
                ]
            },
            {
                "title": {
                    "key": "step-3-title",
                    "referenceValue": "Customize summary table",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-3-1",
                        "translations": {},
                        "referenceValue": "![Customize summary table](https://user-images.githubusercontent.com/2181866/102776381-ee751680-438e-11eb-95fb-90493262afc3.gif)\n\nBy now, a table should appear showing a summary of the individuals that are already being tracked in the program at the location that you have selected.\n\nYou can choose what information you want to see in this table by clicking on the table icon and selecting or deselecting data columns from the list. Remember to click 'Save' to save any changes to your table."
                    },
                    {
                        "key": "step-3-2",
                        "translations": {},
                        "referenceValue": "![Customize summary table](https://user-images.githubusercontent.com/2181866/102776383-ee751680-438e-11eb-9626-040d34a9d9e0.gif)\n\nYou can sort the information by columns by clicking on the column names. This will rearrange the data from the highest to lowest values or vice versa, or alphabetically. The red arrow next to the column name shows you the order of the data that has been sorted in the column.\n\nYou can also download the data table by clicking the download icon. In the drop-down menu, you can choose to download the table as different file types including XML, JSON or CSV."
                    }
                ]
            },
            {
                "title": {
                    "key": "step-4-title",
                    "referenceValue": "Register new individual",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-4-1",
                        "translations": {},
                        "referenceValue": "![Register new individual](https://user-images.githubusercontent.com/2181866/102776384-ee751680-438e-11eb-8ad2-a66c1bc0a5b4.gif)\n\nTo register a new individual that will be tracked through the program, click 'Register'. A new registration form will appear for you to enter the details of the individual.\n\nUnder Enrollment, DHIS2 automatically fills in the 'Enrollling organisation unit' based on the location that you selected in Step 1.\n\nSelect an enrollment date by clicking on the bar to open the drop-down calendar. Select the enrollment date by scrolling through months and years on the calendar, and clicking on the day of the month."
                    },
                    {
                        "key": "step-4-2",
                        "translations": {},
                        "referenceValue": "![Register new individual](https://user-images.githubusercontent.com/2181866/102776385-ef0dad00-438e-11eb-98c1-4ba4bbf659c2.gif)\n\nUnder Profile, fill in the details about the individual that you are registering. Complete the form by filling in the data from the drop-down menus or by manually adding in the values.\n\nGreyed-out entries are values determined automatically by the DHIS2 system, such as the unique ID  for your individual. You do not need to enter anything in them."
                    },
                    {
                        "key": "step-4-3",
                        "translations": {},
                        "referenceValue": "![Register new individual](https://user-images.githubusercontent.com/2181866/102776386-ef0dad00-438e-11eb-9384-6a9d3e5d1033.gif)\n\nOnce the registration form is complete, click on 'Save and continue' to move onto the next step. This will enroll your individual into the selected tracker program and take you to a dashboard where the individual's data is managed.\n\nAlternatively, if you want to save this form and register another new individual for the same program and location, click 'Save and add new'."
                    },
                    {
                        "key": "step-4-4",
                        "translations": {},
                        "referenceValue": "The dashboard has many boxes ('widgets') displaying different information about your individual.\n\nYou will see two boxes (Profile and Enrollment) display the data that you entered during registration.\n\nThe 'Profile' box provides a summary of the individual that is being tracked, with all the identifying information that you added.\n\n![Register new individual](https://user-images.githubusercontent.com/2181866/102776370-eae18f80-438e-11eb-8cd1-243aa5020138.jpg)\n\nThe 'Enrollment' box presents information about when the individual was enrolled in the program and by which organisation unit. This window may include other information that was submitted for this individual during registration.\n\n![Register new individual](https://user-images.githubusercontent.com/2181866/102776404-f2089d80-438e-11eb-97f1-d78cb6ccba2f.jpg)"
                    }
                ]
            },
            {
                "title": {
                    "key": "step-5-title",
                    "referenceValue": "Enter data in phases",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-5-1",
                        "translations": {},
                        "referenceValue": "![Enter data in phases](https://user-images.githubusercontent.com/2181866/102776387-efa64380-438e-11eb-97e3-16d09321a79a.gif)\n\nThe 'Timeline Data Entry' box allows you to gather data and track your individual through many phases of the program. It creates a timeline of the data that you enter in data collection forms as the individual passes through each phase (or through events of the same phase).\n\nTo enter data for a new phase of the program and add it to your timeline, click on the plus icon.\n\nOn the new window, select the phase of the program that you would like to enter data for by clicking on the 'Program stage' bar. Search through the program phases available and click one to select it.\n\n<i>Note: In some cases, depending on the program that you are tracking, you may have to enter data in phases sequentially i.e. you may not be able to enter data for later phases before you have passed through the earlier phases in a defined, logical sequence.</i>"
                    },
                    {
                        "key": "step-5-2",
                        "translations": {},
                        "referenceValue": "![Enter data in phases](https://user-images.githubusercontent.com/2181866/102776388-efa64380-438e-11eb-8450-e4f74b543805.gif)\n\nComplete the form by filling in the data from the drop-down menus or by manually adding in the values.\n\nWhen you have completed the form, click 'Save' to go back to the tracker dashboard. You will notice that a yellow box has appeared in the Timeline Data Entry box, showing you which phase of the program you are entering data for.\n\nAs you add data for more phases, a timeline of boxes will be created in this box, showing your individual progressing through the phases of the program."
                    },
                    {
                        "key": "step-5-3",
                        "translations": {},
                        "referenceValue": "![Enter data in phases](https://user-images.githubusercontent.com/2181866/102776390-efa64380-438e-11eb-95b6-429cfa710b4c.gif)\n\nBelow the yellow box timeline, you should see a data entry form for this phase has appeared.\n\nEnter your data in the form by selecting data from the drop-down menus or by manually adding in the values. Some data will be filled in automatically."
                    },
                    {
                        "key": "step-5-4",
                        "translations": {},
                        "referenceValue": "![Enter data in phases](https://user-images.githubusercontent.com/2181866/102776391-f03eda00-438e-11eb-8362-874f5bf23e6b.gif)\n\nIf you have notes to add to the form, you can leave a comment in the box saying 'Your note here'. Click 'Add' to submit your comment and it will appear below the form.\n\nWhen you have completed entering data in the form, click 'Complete'. The yellow box for this phase on the timeline will be marked with '(complete)'.\n\nIf you need to review or validate the data later, do not click complete. The yellow box will turn grey and be labelled as '(open)' to mark forms that will need to be revisited."
                    },
                    {
                        "key": "step-5-5",
                        "translations": {},
                        "referenceValue": "![Enter data in phases](https://user-images.githubusercontent.com/2181866/102776394-f03eda00-438e-11eb-8b31-d7040c1d5751.gif)\n\nTo enter data for the next event or phase of the program, click on the plus icon. Follow the same steps in the previous Sub steps 1 - 4 to add data and to continue building your timeline.\n\n<i>Note: Depending on the program that you are tracking, you may only be allowed to enter data for one event per phase. In this case, once you have completed the data entry for a phase, it may no longer appear on the list of program phases to select in Sub step 1 of 4. Other programs may have phases that have several events and can have data entered multiple times.</i>"
                    }
                ]
            },
            {
                "title": {
                    "key": "step-6-title",
                    "referenceValue": "Edit data timeline",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-6-1",
                        "translations": {},
                        "referenceValue": "![Edit data timeline](https://user-images.githubusercontent.com/2181866/102776395-f0d77080-438e-11eb-8009-30f36f28b4aa.gif)\n\nEvery time data is added for a new phase, a new yellow box will appear on the timeline. These boxes are ordered by date. At any point, you can click on the boxes from previous phases to review that data collected on your individual.\n\nIf you modify the dates of any phase and this shifts the time sequence of the phases, the yellow boxes may shift order in the timeline."
                    },
                    {
                        "key": "step-6-2",
                        "translations": {},
                        "referenceValue": "![Edit data timeline](https://user-images.githubusercontent.com/2181866/102776398-f0d77080-438e-11eb-9660-8dcf8d495581.gif)\n\nYou can also modify how the timeline appears. From the Timeline Data Entry menu, click the table icon and select 'Grid form'. This will display the data for the selected phase in a table. This is suitable if you have many data collection forms completed for the same phase of the program.\n\nAdd new entries to the table by clicking 'Add'. This will create a data entry form arranged as a table, where you can enter new data under each column.\n\nYou can print this table by clicking 'Print form'. In the new window, you can download the report as a PDF by selecting 'Save as PDF' from the 'Destination' menu."
                    }
                ]
            },
            {
                "title": {
                    "key": "step-7-title",
                    "referenceValue": "Create relationships between individuals",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-7-1",
                        "translations": {},
                        "referenceValue": "![Create relationships between individuals](https://user-images.githubusercontent.com/2181866/102776373-ec12bc80-438e-11eb-8c43-972cfc8b3ed1.jpg)\n\nThe 'Relationships' box allows you to create links between individuals being tracked through different programs. For example, you can create a relationship between a pregnant women in a antenatal program and her child tracked through a neonatal program and all the mosquitoes that were collected within that sample.\n\nThe links that you have created between individuals are shown in the Relationships table."
                    },
                    {
                        "key": "step-7-2",
                        "translations": {},
                        "referenceValue": "![Create relationships between individuals](https://user-images.githubusercontent.com/2181866/102776399-f1700700-438e-11eb-8aa9-b90ac36e6c0b.gif)\n\nTo create a new relationship, click 'Add'. Relationships can be defined between individuals that already exist and are being tracked in DHIS2, or you can create new individuals.\n\nSelect the relationship from the drop-down menu. This is the entity in another program that you want your individual to be connected to.\n\nIn the window that appears, search for specific entities that you would like to connect your individual to. If you know the entity's unique ID, you can type this in the search bar. A profile report of the entity that you searched for will appear. This displays data on your individual that is stored on the DHIS2 system.\n\nClick 'Save' to connect this entity with your individual.\n\nYou can also go 'Back' to look for another entity, or you can register a new one. When you click 'Register', you will go to the same enrollment form from Step 1. Click 'Save' when you have added all the information on the entity and this will create a new individual in the system (to appear in the summary table of individuals) and add the relationship with your individual."
                    }
                ]
            },
            {
                "title": {
                    "key": "step-8-title",
                    "referenceValue": "Track your indicators",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-8-1",
                        "translations": {},
                        "referenceValue": "![Track your indicators](https://user-images.githubusercontent.com/2181866/102776376-ec12bc80-438e-11eb-8ee7-184dcb35ae62.jpg)\n\nThe 'Indicators' box shows indicators that are calculated automatically by DHIS2 using the data collected at the different phases of the program. These indicators may be relevant to your individual or to the location where you sampled your individual etc.\n\nYou can choose to display as many indicators as you want here. This allows you to track data in these indicators over long periods of time throughout the program."
                    }
                ]
            },
            {
                "title": {
                    "key": "step-9-title",
                    "referenceValue": "Print report of data",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-9-1",
                        "translations": {},
                        "referenceValue": "![Print report of data](https://user-images.githubusercontent.com/2181866/102776400-f1700700-438e-11eb-944f-5dd27bc245e9.gif)\n\nThe 'Report' box allows you to create a summary report of all the data gathered for this individual in each event or phase of the program. To download this report, click 'Print'. In the new window, you can download the report as a PDF by selecting 'Save as PDF' from the 'Destination' menu."
                    }
                ]
            },
            {
                "title": {
                    "key": "step-10-title",
                    "referenceValue": "Customize tracker dashboard",
                    "translations": {}
                },
                "pages": [
                    {
                        "key": "step-10-1",
                        "translations": {},
                        "referenceValue": "![Customize tracker dashboard](https://user-images.githubusercontent.com/2181866/102776402-f2089d80-438e-11eb-801e-f4e1216e038f.gif)\n\nYou can remove or add boxes on the dashboard by clicking the cog icon on the top right of the dashboard and selecting 'Show/hide widgets'. Check boxes that you want or uncheck unwanted boxes and click 'Save'.\n\nYou can also save your modified dashboard configuration to appear every time you open this tracker program by clicking 'Save dashboard layout as default'.\n\nYou can also move and reorder the windows on the Tracker dashboard around by clicking and dragging the panels to their new positions."
                    }
                ]
            }
        ]
    }
}
